function getGhaatChakraByRashi(rashiNumber, gender) {
    const rashiList = [
        "मेष", "वृषभ", "मिथुन", "कर्क", "सिंह", "कन्या",
        "तुला", "वृश्चिक", "धनु", "मकर", "कुंभ", "मीन"
    ];

    const ghaatChakar = []

    const ghaatChakraData = {
        "मेष": {
            घातमास: "कात्तिक", घाततिथि: "1, 6, 11", घातवार: "रविवार", घातनक्षत्र: "मघा",
            घातयोग: "विष्कुम्भ", घातकरण: "बव", प्रहर: "1", पुरुषराशि: "मेष", स्त्रीराशि: "मेष"
        },
        "वृषभ": {
            घातमास: "मार्गशीर्ष", घाततिथि: "5, 10, 15", घातवार: "शनिवार", घातनक्षत्र: "हस्त",
            घातयोग: "शुक्ल", घातकरण: "शकुनि", प्रहर: "4", पुरुषराशि: "कन्या", स्त्रीराशि: "धनु"
        },
        "मिथुन": {
            घातमास: "आषाढ", घाततिथि: "2, 7, 12", घातवार: "सोमवार", घातनक्षत्र: "स्वाति",
            घातयोग: "परिघ", घातकरण: "कौलव", प्रहर: "3", पुरुषराशि: "कुम्भ", स्त्रीराशि: "धनु"
        },
        "कर्क": {
            घातमास: "पोष", घाततिथि: "2, 7, 12", घातवार: "बुधवार", घातनक्षत्र: "अनुराधा",
            घातयोग: "व्याघात", घातकरण: "नाग", प्रहर: "1", पुरुषराशि: "सिंह", स्त्रीराशि: "मीन"
        },
        "सिंह": {
            घातमास: "ज्येष्ठ", घाततिथि: "3, 8, 13", घातवार: "शनिवार", घातनक्षत्र: "मूल",
            घातयोग: "धृति", घातकरण: "बव", प्रहर: "1", पुरुषराशि: "मकर", स्त्रीराशि: "वृश्चिक"
        },
        "कन्या": {
            घातमास: "भाद्रपद", घाततिथि: "5, 10, 15", घातवार: "शनिवार", घातनक्षत्र: "श्रवण",
            घातयोग: "शुक्ल", घातकरण: "कौलव", प्रहर: "1", पुरुषराशि: "मिथुन", स्त्रीराशि: "वृश्चिक"
        },
        "तुला": {
            घातमास: "माघ", घाततिथि: "4, 9, 14", घातवार: "गुरुवार", घातनक्षत्र: "शतभिषा",
            घातयोग: "शुक्ल", घातकरण: "तैतिल", प्रहर: "4", पुरुषराशि: "धनु", स्त्रीराशि: "मीन"
        },
        "वृश्चिक": {
            घातमास: "आष्विन", घाततिथि: "1, 6, 11", घातवार: "शुक्रवार", घातनक्षत्र: "रेवती",
            घातयोग: "व्यतिपात", घातकरण: "गर", प्रहर: "1", पुरुषराशि: "वृषभ", स्त्रीराशि: "धनु"
        },
        "धनु": {
            घातमास: "श्रावण", घाततिथि: "3, 8, 13", घातवार: "शुक्रवार", घातनक्षत्र: "भरणी",
            घातयोग: "वज्र", घातकरण: "तैतिल", प्रहर: "1", पुरुषराशि: "मीन", स्त्रीराशि: "कन्या"
        },
        "मकर": {
            घातमास: "वैशाख", घाततिथि: "4, 9, 14", घातवार: "मंगलवार", घातनक्षत्र: "रोहिणी",
            घातयोग: "वैघृति", घातकरण: "शकुनि", प्रहर: "4", पुरुषराशि: "सिंह", स्त्रीराशि: "वृश्चिक"
        },
        "कुंभ": {
            घातमास: "चैत्र", घाततिथि: "3, 8, 13", घातवार: "गुरुवार", घातनक्षत्र: "आर्द्रा",
            घातयोग: "गण्ड", घातकरण: "किंस्तुघ्न", प्रहर: "3", पुरुषराशि: "धनु", स्त्रीराशि: "मिथुन"
        },
        "मीन": {
            घातमास: "फाल्गुन", घाततिथि: "5, 10, 15", घातवार: "शुक्रवार", घातनक्षत्र: "आश्लेषा",
            घातयोग: "वज्र", घातकरण: "चतुष्पाद", प्रहर: "4", पुरुषराशि: "कुंभ", स्त्रीराशि: "कुंभ"
        }
    };

    const index = rashiNumber - 1;
    const rashiName = rashiList[index];

    if (!rashiName || !ghaatChakraData[rashiName]) {
        return "Invalid Rashi number. It must be between 1 and 12.";
    }

    if(gender === 'male') {
        ghaatChakar.push({
            घातमास: ghaatChakraData[rashiName].घातमास,
            घाततिथि: ghaatChakraData[rashiName].घाततिथि,
            घातवार: ghaatChakraData[rashiName].घातवार,
            घातनक्षत्र: ghaatChakraData[rashiName].घातनक्षत्र,
            घातयोग: ghaatChakraData[rashiName].घातयोग,
            घातकरण: ghaatChakraData[rashiName].घातकरण,
            प्रहर: ghaatChakraData[rashiName].प्रहर,
            पुरुषराशि: ghaatChakraData[rashiName].पुरुषराशि
        });

        return ghaatChakar ;
    }

    else if(gender === 'female') {
        ghaatChakar.push({
            घातमास: ghaatChakraData[rashiName].घातमास,
            घाततिथि: ghaatChakraData[rashiName].घाततिथि,
            घातवार: ghaatChakraData[rashiName].घातवार,
            घातनक्षत्र: ghaatChakraData[rashiName].घातनक्षत्र,
            घातयोग: ghaatChakraData[rashiName].घातयोग,
            घातकरण: ghaatChakraData[rashiName].घातकरण,
            प्रहर: ghaatChakraData[rashiName].प्रहर,
            स्त्रीराशि: ghaatChakraData[rashiName].स्त्रीराशि
        });

        return ghaatChakar ;
    }
}

module.exports = { getGhaatChakraByRashi }
